<template>
    <div class="company-block" id="company">
        <div class="title">
          О компании
        </div>
      <div class="logo">
        <img src="../../assets/images/logo.png" alt="">
      </div>
      <div class="text">
        <p> Fukurou является зарегистрированной торговой маркой, принадлежит группе компаний HIGASHI RUS. Fukurou(Фукуро) в переводе с японского означает сову-символ спокойствия, уверенности, прекрасного зрения в ночи. Основные продукты  компании- товары, которые особенно необходимы в сложных погодных условиях. Мы надеемся,  что вы оцените технологичность и качество наших продуктов и будете с удовольствием  пользоваться ими.  </p>
        <p>Fukurou-молодая компания, внимательно отслеживающая и использующая последние достижения в автомобильной индустрии. Разработки продукции ведутся с учетом появления новейших технологий и жестких внутренних стандартов контроля качества. Заказы размещаются на самых передовых и высокотехнологичных производствах мира. Мы отслеживаем и объединяем технологии, преимущества и возможности различных корпорации и предлагаем лучшие продукты на рынке.
        </p>

        <p style="color: #ffb536">Наша миссия: предугадать, ответить, сопровождать все Ваши потребности на рынке автозапчастей.
        </p>
      </div>
    </div>
</template>

<script src="./company-block.js"></script>

<style scoped src="./company-block.scss" lang="scss">

</style>
