<template>
    <div class="company-block" id="company">
        <div class="title">
          О компании
        </div>
      <div class="logo">
        <img src="../../assets/images/logo.png" alt="">
      </div>
      <div class="text">
        <p>Fukurou - молодая компания, внимательно отслеживающая и использующая последние достижения в автомобильной индустрии. Разработки продукции ведутся с учетом появления новейших технологий и жестких внутренних стандартов контроля качества. </p>
        <p>Заказы размещаются на самых передовых и высокотехнологичных производствах мира. </p>
        <p>Мы отслеживаем и объединяем технологии, преимущества и возможности различных корпорации и предлагаем лучшие продукты на рынке. Задача компании обеспечить рынок автозапчастей высококачественной безопасной
          продукцией, повышать безопасность на дороге, уменьшать аварийность, предлагая продукцию самого высокого качества.
        </p>
        <p style="color: #ffb536">Наша миссия: предугадать, ответить, сопровождать все Ваши потребности на рынке автозапчастей.</p>
      </div>
    </div>
</template>

<script src="./company-block.js"></script>

<style scoped src="./company-block.scss" lang="scss">

</style>
